Revit 2026 API

# StructuralInstanceUsageFilter Properties

---

The StructuralInstanceUsageFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |
|  | StructuralUsage | The family instance structural usage. |

#### Reference

StructuralInstanceUsageFilter Class

Autodesk.Revit.DB.Structure Namespace